/** All locales with the dashes and capitalization, e.g. `en-US`, `zh-Hant-HK`. */
export enum Locale {
  /** 아프리카어 */
  af = 'af',
  /** 아프리카어 (나미비아) */
  af_NA = 'af-NA',
  /** 아프리카어 (남아프리카) */
  af_ZA = 'af-ZA',
  /** 아프리카어 (남수단) */
  agq = 'agq',
  /** 아프리카어 (카메룬) */
  agq_CM = 'agq-CM',
  /** 아프리카어 (가나) */
  ak = 'ak',
  /** 아프리카어 (가나) */
  ak_GH = 'ak-GH',
  /** 암하라어 */
  am = 'am',
  /** 암하라어 (에티오피아) */
  am_ET = 'am-ET',
  /** 아랍어 */
  ar = 'ar',
  /** 아랍어 (세계) */
  ar_001 = 'ar-001',
  /** 아랍어 (아랍에미리트) */
  ar_AE = 'ar-AE',
  /** 아랍어 (바레인) */
  ar_BH = 'ar-BH',
  /** 아랍어 (알제리) */
  ar_DZ = 'ar-DZ',
  /** 아랍어 (이집트) */
  ar_EG = 'ar-EG',
  /** 아랍어 (이라크) */
  ar_IQ = 'ar-IQ',
  /** 아랍어 (요르단) */
  ar_JO = 'ar-JO',
  /** 아랍어 (쿠웨이트) */
  ar_KW = 'ar-KW',
  /** 아랍어 (레바논) */
  ar_LB = 'ar-LB',
  /** 아랍어 (리비아) */
  ar_LY = 'ar-LY',
  /** 아랍어 (모로코) */
  ar_MA = 'ar-MA',
  /** 아랍어 (오만) */
  ar_OM = 'ar-OM',
  /** 아랍어 (카타르) */
  ar_QA = 'ar-QA',
  /** 아랍어 (사우디아라비아) */
  ar_SA = 'ar-SA',
  /** 아랍어 (수단) */
  ar_SD = 'ar-SD',
  /** 아랍어 (시리아) */
  ar_SY = 'ar-SY',
  /** 아랍어 (튀니지) */
  ar_TN = 'ar-TN',
  /** 아랍어 (예멘) */
  ar_YE = 'ar-YE',
  /** 아삼어 */
  as = 'as',
  /** 아삼어 (인도) */
  as_IN = 'as-IN',
  /** 아수어 */
  asa = 'asa',
  /** 아수어 (탄자니아) */
  asa_TZ = 'asa-TZ',
  /** 아제르바이잔어 */
  az = 'az',
  /** 아제르바이잔어 (키릴) */
  az_Cyrl = 'az-Cyrl',
  /** 아제르바이잔어 (키릴, 아제르바이잔) */
  az_Cyrl_AZ = 'az-Cyrl-AZ',
  /** 아제르바이잔어 (라틴) */
  az_Latn = 'az-Latn',
  /** 아제르바이잔어 (라틴, 아제르바이잔) */
  az_Latn_AZ = 'az-Latn-AZ',
  /** 바사어 */
  bas = 'bas',
  /** 바사어 (카메룬) */
  bas_CM = 'bas-CM',
  /** 벨라루스어 */
  be = 'be',
  /** 벨라루스어 (벨라루스) */
  be_BY = 'be-BY',
  /** 벰바어 */
  bem = 'bem',
  /** 벰바어 (잠비아) */
  bem_ZM = 'bem-ZM',
  /** 베나어 */
  bez = 'bez',
  /** 베나어 (탄자니아) */
  bez_TZ = 'bez-TZ',
  /** 불가리아어 */
  bg = 'bg',
  /** 불가리아어 (불가리아) */
  bg_BG = 'bg-BG',
  /** 밤바라어 */
  bm = 'bm',
  /** 밤바라어 (말리) */
  bm_ML = 'bm-ML',
  /** 벵골어 */
  bn = 'bn',
  /** 벵골어 (방글라데시) */
  bn_BD = 'bn-BD',
  /** 벵골어 (인도) */
  bn_IN = 'bn-IN',
  /** 티베트어 */
  bo = 'bo',
  /** 티베트어 (중국) */
  bo_CN = 'bo-CN',
  /** 티베트어 (인도) */
  bo_IN = 'bo-IN',
  /** 브르타뉴어 */
  br = 'br',
  /** 브르타뉴어 (프랑스) */
  br_FR = 'br-FR',
  /** 보도어 */
  brx = 'brx',
  /** 보도어 (인도) */
  brx_IN = 'brx-IN',
  /** 보스니아어 */
  bs = 'bs',
  /** 보스니아어 (보스니아 헤르체고비나) */
  bs_BA = 'bs-BA',
  /** 카탈루냐어 */
  ca = 'ca',
  /** 카탈루냐어 (스페인) */
  ca_ES = 'ca-ES',
  /** 치가어 */
  cgg = 'cgg',
  /** 치가어 (우간다) */
  cgg_UG = 'cgg-UG',
  /** 체로키어 */
  chr = 'chr',
  /** 체로키어 (미국) */
  chr_US = 'chr-US',
  /** 체코어 */
  cs = 'cs',
  /** 체코어 (체코) */
  cs_CZ = 'cs-CZ',
  /** 웨일스어 */
  cy = 'cy',
  /** 웨일스어 (영국) */
  cy_GB = 'cy-GB',
  /** 덴마크어 */
  da = 'da',
  /** 덴마크어 (덴마크) */
  da_DK = 'da-DK',
  /** 타이타어 */
  dav = 'dav',
  /** 타이타어 (케냐) */
  dav_KE = 'dav-KE',
  /** 독일어 */
  de = 'de',
  /** 독일어 (오스트리아) */
  de_AT = 'de-AT',
  /** 독일어 (벨기에) */
  de_BE = 'de-BE',
  /** 독일어 (스위스) */
  de_CH = 'de-CH',
  /** 독일어 (독일) */
  de_DE = 'de-DE',
  /** 독일어 (리히텐슈타인) */
  de_LI = 'de-LI',
  /** 독일어 (룩셈부르크) */
  de_LU = 'de-LU',
  /** 자르마어 */
  dje = 'dje',
  /** 자르마어 (니제르) */
  dje_NE = 'dje-NE',
  /** 두알라어 */
  dua = 'dua',
  /** 두알라어 (카메룬) */
  dua_CM = 'dua-CM',
  /** 졸라어 */
  dyo = 'dyo',
  /** 졸라어 (세네갈) */
  dyo_SN = 'dyo-SN',
  /** 엠부어 */
  ebu = 'ebu',
  /** 엠부어 (케냐) */
  ebu_KE = 'ebu-KE',
  /** 에웨어 */
  ee = 'ee',
  /** 에웨어 (가나) */
  ee_GH = 'ee-GH',
  /** 에웨어 (토고) */
  ee_TG = 'ee-TG',
  /** 그리스어 */
  el = 'el',
  /** 그리스어 (키프로스) */
  el_CY = 'el-CY',
  /** 그리스어 (그리스) */
  el_GR = 'el-GR',
  /** 영어 */
  en = 'en',
  /** 영어 (아랍에미리트) */
  en_AE = 'en-AE',
  /** 영어 (아르헨티나) */
  en_AR = 'en-AR',
  /** 영어 (아메리칸 사모아) */
  en_AS = 'en-AS',
  /** 영어 (오스트리아) */
  en_AT = 'en-AT',
  /** 영어 (오스트레일리아) */
  en_AU = 'en-AU',
  /** 영어 (바베이도스) */
  en_BB = 'en-BB',
  /** 영어 (벨기에) */
  en_BE = 'en-BE',
  /** 영어 (불가리아) */
  en_BG = 'en-BG',
  /** 영어 (바레인) */
  en_BH = 'en-BH',
  /** 영어 (버뮤다) */
  en_BM = 'en-BM',
  /** 영어 (브라질) */
  en_BR = 'en-BR',
  /** 영어 (보츠와나) */
  en_BW = 'en-BW',
  /** 영어 (벨리즈) */
  en_BZ = 'en-BZ',
  /** 영어 (캐나다) */
  en_CA = 'en-CA',
  /** 영어 (스위스) */
  en_CH = 'en-CH',
  /** 영어 (칠레) */
  en_CL = 'en-CL',
  /** 영어 (중국) */
  en_CN = 'en-CN',
  /** 영어 (콜롬비아) */
  en_CO = 'en-CO',
  /** 영어 (코스타리카) */
  en_CR = 'en-CR',
  /** 영어 (키프로스) */
  en_CY = 'en-CY',
  /** 영어 (체코) */
  en_CZ = 'en-CZ',
  /** 영어 (독일) */
  en_DE = 'en-DE',
  /** 영어 (덴마크) */
  en_DK = 'en-DK',
  /** 영어 (도미니카 공화국) */
  en_DO = 'en-DO',
  /** 영어 (에스토니아) */
  en_EE = 'en-EE',
  /** 영어 (이집트) */
  en_EG = 'en-EG',
  /** 영어 (스페인) */
  en_ES = 'en-ES',
  /** 영어 (핀란드) */
  en_FI = 'en-FI',
  /** 영어 (영국) */
  en_GB = 'en-GB',
  /** 영어 (조지아) */
  en_GE = 'en-GE',
  /** 영어 (프랑스령 기아나) */
  en_GF = 'en-GF',
  /** 영어 (가나) */
  en_GH = 'en-GH',
  /** 영어 (지브롤터) */
  en_GI = 'en-GI',
  /** 영어 (그리스) */
  en_GR = 'en-GR',
  /** 영어 (괌) */
  en_GU = 'en-GU',
  /** 영어 (가이아나) */
  en_GY = 'en-GY',
  /** 영어 (홍콩) */
  en_HK = 'en-HK',
  /** 영어 (크로아티아) */
  en_HR = 'en-HR',
  /** 영어 (헝가리) */
  en_HU = 'en-HU',
  /** 영어 (인도네시아) */
  en_ID = 'en-ID',
  /** 영어 (아일랜드) */
  en_IE = 'en-IE',
  /** 영어 (이스라엘) */
  en_IL = 'en-IL',
  /** 영어 (인도) */
  en_IN = 'en-IN',
  /** 영어 (아이슬란드) */
  en_IS = 'en-IS',
  /** 영어 (이탈리아) */
  en_IT = 'en-IT',
  /** 영어 (자메이카) */
  en_JM = 'en-JM',
  /** 영어 (요르단) */
  en_JO = 'en-JO',
  /** 영어 (일본) */
  en_JP = 'en-JP',
  /** 영어 (대한민국) */
  en_KR = 'en-KR',
  /** 영어 (쿠웨이트) */
  en_KW = 'en-KW',
  /** 영어 (케이맨 제도) */
  en_KY = 'en-KY',
  /** 영어 (레바논) */
  en_LB = 'en-LB',
  /** 영어 (리히텐슈타인) */
  en_LI = 'en-LI',
  /** 영어 (리투아니아) */
  en_LT = 'en-LT',
  /** 영어 (룩셈부르크) */
  en_LU = 'en-LU',
  /** 영어 (라트비아) */
  en_LV = 'en-LV',
  /** 영어 (모로코) */
  en_MA = 'en-MA',
  /** 영어 (모나코) */
  en_MC = 'en-MC',
  /** 영어 (마다가스카르) */
  en_MG = 'en-MG',
  /** 영어 (마셜 제도) */
  en_MH = 'en-MH',
  /** 영어 (북마케도니아) */
  en_MK = 'en-MK',
  /** 영어 (마카오) */
  en_MO = 'en-MO',
  /** 영어 (북마리아나 제도) */
  en_MP = 'en-MP',
  /** 영어 (몰타) */
  en_MT = 'en-MT',
  /** 영어 (모리셔스) */
  en_MU = 'en-MU',
  /** 영어 (멕시코) */
  en_MX = 'en-MX',
  /** 영어 (말레이시아) */
  en_MY = 'en-MY',
  /** 영어 (나미비아) */
  en_NA = 'en-NA',
  /** 영어 (네덜란드) */
  en_NL = 'en-NL',
  /** 영어 (노르웨이) */
  en_NO = 'en-NO',
  /** 영어 (뉴질랜드) */
  en_NZ = 'en-NZ',
  /** 영어 (오만) */
  en_OM = 'en-OM',
  /** 영어 (페루) */
  en_PE = 'en-PE',
  /** 영어 (필리핀) */
  en_PH = 'en-PH',
  /** 영어 (파키스탄) */
  en_PK = 'en-PK',
  /** 영어 (폴란드) */
  en_PL = 'en-PL',
  /** 영어 (푸에르토리코) */
  en_PR = 'en-PR',
  /** 영어 (포르투갈) */
  en_PT = 'en-PT',
  /** 영어 (파라과이) */
  en_PY = 'en-PY',
  /** 영어 (카타르) */
  en_QA = 'en-QA',
  /** 영어 (루마니아) */
  en_RO = 'en-RO',
  /** 영어 (러시아) */
  en_RU = 'en-RU',
  /** 영어 (사우디아라비아) */
  en_SA = 'en-SA',
  /** 영어 (스웨덴) */
  en_SE = 'en-SE',
  /** 영어 (싱가포르) */
  en_SG = 'en-SG',
  /** 영어 (슬로바키아) */
  en_SK = 'en-SK',
  /** 영어 (슬로베니아) */
  en_SI = 'en-SI',
  /** 영어 (태국) */
  en_TH = 'en-TH',
  /** 영어 (터키) */
  en_TR = 'en-TR',
  /** 영어 (트리니다드 토바고) */
  en_TT = 'en-TT',
  /** 영어 (대만) */
  en_TW = 'en-TW',
  /** 영어 (우크라이나) */
  en_UA = 'en-UA',
  /** 영어 (미국) */
  en_UM = 'en-UM',
  /** 영어 (미국) */
  en_US = 'en-US',
  /** 영어 (미국, POSIX) */
  en_US_POSIX = 'en-US-POSIX',
  /** 영어 (우루과이) */
  en_UY = 'en-UY',
  /** 영어 (베네수엘라) */
  en_VE = 'en-VE',
  /** 영어 (미국령 버진아일랜드) */
  en_VI = 'en-VI',
  /** 영어 (베트남) */
  en_VN = 'en-VN',
  /** 영어 (남아프리카) */
  en_ZA = 'en-ZA',
  /** 영어 (짐바브웨) */
  en_ZW = 'en-ZW',
  /** 에스페란토어 */
  eo = 'eo',
  /** 스페인어 */
  es = 'es',
  /** 스페인어 (라틴 아메리카) */
  es_419 = 'es-419',
  /** 스페인어 (아르헨티나) */
  es_AR = 'es-AR',
  /** 스페인어 (볼리비아) */
  es_BO = 'es-BO',
  /** 스페인어 (칠레) */
  es_CL = 'es-CL',
  /** 스페인어 (콜롬비아) */
  es_CO = 'es-CO',
  /** 스페인어 (코스타리카) */
  es_CR = 'es-CR',
  /** 스페인어 (도미니카 공화국) */
  es_DO = 'es-DO',
  /** 스페인어 (에콰도르) */
  es_EC = 'es-EC',
  /** 스페인어 (스페인) */
  es_ES = 'es-ES',
  /** 스페인어 (적도 기니) */
  es_GQ = 'es-GQ',
  /** 스페인어 (과테말라) */
  es_GT = 'es-GT',
  /** 스페인어 (온두라스) */
  es_HN = 'es-HN',
  /** 스페인어 (멕시코) */
  es_MX = 'es-MX',
  /** 스페인어 (니카라과) */
  es_NI = 'es-NI',
  /** 스페인어 (파나마) */
  es_PA = 'es-PA',
  /** 스페인어 (페루) */
  es_PE = 'es-PE',
  /** 스페인어 (푸에르토리코) */
  es_PR = 'es-PR',
  /** 스페인어 (파라과이) */
  es_PY = 'es-PY',
  /** 스페인어 (엘살바도르) */
  es_SV = 'es-SV',
  /** 스페인어 (미국) */
  es_US = 'es-US',
  /** 스페인어 (우루과이) */
  es_UY = 'es-UY',
  /** 스페인어 (베네수엘라) */
  es_VE = 'es-VE',
  /** 에스토니아어 */
  et = 'et',
  /** 에스토니아어 (에스토니아) */
  et_EE = 'et-EE',
  /** 바스크어 */
  eu = 'eu',
  /** 바스크어 (스페인) */
  eu_ES = 'eu-ES',
  /** 에웁도어 */
  ewo = 'ewo',
  /** 에웁도어 (카메룬) */
  ewo_CM = 'ewo-CM',
  /** 페르시아어 */
  fa = 'fa',
  /** 페르시아어 (아프가니스탄) */
  fa_AF = 'fa-AF',
  /** 페르시아어 (이란) */
  fa_IR = 'fa-IR',
  /** 풀라어 */
  ff = 'ff',
  /** 풀라어 (세네갈) */
  ff_SN = 'ff-SN',
  /** 핀란드어 */
  fi = 'fi',
  /** 핀란드어 (핀란드) */
  fi_FI = 'fi-FI',
  /** 필리핀어 */
  fil = 'fil',
  /** 필리핀어 (필리핀) */
  fil_PH = 'fil-PH',
  /** 페로어 */
  fo = 'fo',
  /** 페로어 (페로 제도) */
  fo_FO = 'fo-FO',
  /** 프랑스어 */
  fr = 'fr',
  /** 프랑스어 (벨기에) */
  fr_BE = 'fr-BE',
  /** 프랑스어 (부르키나파소) */
  fr_BF = 'fr-BF',
  /** 프랑스어 (부룬디) */
  fr_BI = 'fr-BI',
  /** 프랑스어 (베냉) */
  fr_BJ = 'fr-BJ',
  /** 프랑스어 (생바르텔레미) */
  fr_BL = 'fr-BL',
  /** 프랑스어 (캐나다) */
  fr_CA = 'fr-CA',
  /** 프랑스어 (콩고 민주 공화국) */
  fr_CD = 'fr-CD',
  /** 프랑스어 (중앙 아프리카 공화국) */
  fr_CF = 'fr-CF',
  /** 프랑스어 (콩고 공화국) */
  fr_CG = 'fr-CG',
  /** 프랑스어 (스위스) */
  fr_CH = 'fr-CH',
  /** 프랑스어 (코트디부아르) */
  fr_CI = 'fr-CI',
  /** 프랑스어 (카메룬) */
  fr_CM = 'fr-CM',
  /** 프랑스어 (지부티) */
  fr_DJ = 'fr-DJ',
  /** 프랑스어 (프랑스) */
  fr_FR = 'fr-FR',
  /** 프랑스어 (가봉) */
  fr_GA = 'fr-GA',
  /** 프랑스어 (프랑스령 기아나) */
  fr_GF = 'fr-GF',
  /** 프랑스어 (기니) */
  fr_GN = 'fr-GN',
  /** 프랑스어 (과들루프) */
  fr_GP = 'fr-GP',
  /** 프랑스어 (적도 기니) */
  fr_GQ = 'fr-GQ',
  /** 프랑스어 (코모로) */
  fr_KM = 'fr-KM',
  /** 프랑스어 (룩셈부르크) */
  fr_LU = 'fr-LU',
  /** 프랑스어 (모나코) */
  fr_MC = 'fr-MC',
  /** 프랑스어 (생마르탱) */
  fr_MF = 'fr-MF',
  /** 프랑스어 (마다가스카르) */
  fr_MG = 'fr-MG',
  /** 프랑스어 (말리) */
  fr_ML = 'fr-ML',
  /** 프랑스어 (마르티니크) */
  fr_MQ = 'fr-MQ',
  /** 프랑스어 (니제르) */
  fr_NE = 'fr-NE',
  /** 프랑스어 (레위니옹) */
  fr_RE = 'fr-RE',
  /** 프랑스어 (르완다) */
  fr_RW = 'fr-RW',
  /** 프랑스어 (세네갈) */
  fr_SN = 'fr-SN',
  /** 프랑스어 (차드) */
  fr_TD = 'fr-TD',
  /** 프랑스어 (토고) */
  fr_TG = 'fr-TG',
  /** 프랑스어 (마요트) */
  fr_YT = 'fr-YT',
  /** 아일랜드어 */
  ga = 'ga',
  /** 아일랜드어 (아일랜드) */
  ga_IE = 'ga-IE',
  /** 갈리시아어 */
  gl = 'gl',
  /** 갈리시아어 (스페인) */
  gl_ES = 'gl-ES',
  /** 스위스 독일어 */
  gsw = 'gsw',
  /** 스위스 독일어 (스위스) */
  gsw_CH = 'gsw-CH',
  /** 구자라트어 */
  gu = 'gu',
  /** 구자라트어 (인도) */
  gu_IN = 'gu-IN',
  /** 구시어 */
  guz = 'guz',
  /** 구시어 (케냐) */
  guz_KE = 'guz-KE',
  /** 맨어 */
  gv = 'gv',
  /** 맨어 (영국) */
  gv_GB = 'gv-GB',
  /** 하우사어 */
  ha = 'ha',
  /** 하우사어 (라틴) */
  ha_Latn = 'ha-Latn',
  /** 하우사어 (라틴, 가나) */
  ha_Latn_GH = 'ha-Latn-GH',
  /** 하우사어 (라틴, 니제르) */
  ha_Latn_NE = 'ha-Latn-NE',
  /** 하우사어 (라틴, 나이지리아) */
  ha_Latn_NG = 'ha-Latn-NG',
  /** 하와이어 */
  haw = 'haw',
  /** 하와이어 (미국) */
  haw_US = 'haw-US',
  /** 히브리어 */
  he = 'he',
  /** 히브리어 (이스라엘) */
  he_IL = 'he-IL',
  /** 힌디어 */
  hi = 'hi',
  /** 힌디어 (인도) */
  hi_IN = 'hi-IN',
  /** 크로아티아어 */
  hr = 'hr',
  /** 크로아티아어 (크로아티아) */
  hr_HR = 'hr-HR',
  /** 헝가리어 */
  hu = 'hu',
  /** 헝가리어 (헝가리) */
  hu_HU = 'hu-HU',
  /** 아르메니아어 */
  hy = 'hy',
  /** 아르메니아어 (아르메니아) */
  hy_AM = 'hy-AM',
  /** 인도네시아어 */
  id = 'id',
  /** 인도네시아어 (인도네시아) */
  id_ID = 'id-ID',
  /** 이그보어 */
  ig = 'ig',
  /** 이그보어 (나이지리아) */
  ig_NG = 'ig-NG',
  /** 쓰촨이어 */
  ii = 'ii',
  /** 쓰촨이어 (중국) */
  ii_CN = 'ii-CN',
  /** 아이슬란드어 */
  is = 'is',
  /** 아이슬란드어 (아이슬란드) */
  is_IS = 'is-IS',
  /** 이탈리아어 */
  it = 'it',
  /** 이탈리아어 (스위스) */
  it_CH = 'it-CH',
  /** 이탈리아어 (이탈리아) */
  it_IT = 'it-IT',
  /** 일본어 */
  ja = 'ja',
  /** 일본어 (일본) */
  ja_JP = 'ja-JP',
  /** 마체메어 */
  jmc = 'jmc',
  /** 마체메어 (탄자니아) */
  jmc_TZ = 'jmc-TZ',
  /** 그루지야어 */
  ka = 'ka',
  /** 그루지야어 (그루지야) */
  ka_GE = 'ka-GE',
  /** 카빌어 */
  kab = 'kab',
  /** 카빌어 (알제리) */
  kab_DZ = 'kab-DZ',
  /** 캄바어 */
  kam = 'kam',
  /** 캄바어 (케냐) */
  kam_KE = 'kam-KE',
  /** 마콘데어 */
  kde = 'kde',
  /** 마콘데어 (탄자니아) */
  kde_TZ = 'kde-TZ',
  /** 카보베르데 크리올어 */
  kea = 'kea',
  /** 카보베르데 크리올어 (카보베르데) */
  kea_CV = 'kea-CV',
  /** 코이라친어 */
  khq = 'khq',
  /** 코이라친어 (말리) */
  khq_ML = 'khq-ML',
  /** 키쿠유어 */
  ki = 'ki',
  /** 키쿠유어 (케냐) */
  ki_KE = 'ki-KE',
  /** 카자흐어 */
  kk = 'kk',
  /** 카자흐어 (키릴) */
  kk_Cyrl = 'kk-Cyrl',
  /** 카자흐어 (키릴, 카자흐스탄) */
  kk_Cyrl_KZ = 'kk-Cyrl-KZ',
  /** 칼라알리수트어 */
  kl = 'kl',
  /** 칼라알리수트어 (그린란드) */
  kl_GL = 'kl-GL',
  /** 칼렌진어 */
  kln = 'kln',
  /** 칼렌진어 (케냐) */
  kln_KE = 'kln-KE',
  /** 크메르어 */
  km = 'km',
  /** 크메르어 (캄보디아) */
  km_KH = 'km-KH',
  /** 칸나다어 */
  kn = 'kn',
  /** 칸나다어 (인도) */
  kn_IN = 'kn-IN',
  /** 한국어 */
  ko = 'ko',
  /** 한국어 (대한민국) */
  ko_KR = 'ko-KR',
  /** 콘카니어 */
  kok = 'kok',
  /** 콘카니어 (인도) */
  kok_IN = 'kok-IN',
  /** 샴발라어 */
  ksb = 'ksb',
  /** 샴발라어 (탄자니아) */
  ksb_TZ = 'ksb-TZ',
  /** 바피아어 */
  ksf = 'ksf',
  /** 바피아어 (카메룬) */
  ksf_CM = 'ksf-CM',
  /** 콘월어 */
  kw = 'kw',
  /** 콘월어 (영국) */
  kw_GB = 'kw-GB',
  /** 람비어 */
  lag = 'lag',
  /** 람비어 (탄자니아) */
  lag_TZ = 'lag-TZ',
  /** 간다어 */
  lg = 'lg',
  /** 간다어 (우간다) */
  lg_UG = 'lg-UG',
  /** 링갈라어 */
  ln = 'ln',
  /** 링갈라어 (콩고 민주 공화국) */
  ln_CD = 'ln-CD',
  /** 링갈라어 (콩고 공화국) */
  ln_CG = 'ln-CG',
  /** 리투아니아어 */
  lt = 'lt',
  /** 리투아니아어 (리투아니아) */
  lt_LT = 'lt-LT',
  /** 루바카탕가어 */
  lu = 'lu',
  /** 루바카탕가어 (콩고 민주 공화국) */
  lu_CD = 'lu-CD',
  /** 루오어 */
  luo = 'luo',
  /** 루오어 (케냐) */
  luo_KE = 'luo-KE',
  /** 루히야어 */
  luy = 'luy',
  /** 루히야어 (케냐) */
  luy_KE = 'luy-KE',
  /** 라트비아어 */
  lv = 'lv',
  /** 라트비아어 (라트비아) */
  lv_LV = 'lv-LV',
  /** 마사이어 */
  mas = 'mas',
  /** 마사이어 (케냐) */
  mas_KE = 'mas-KE',
  /** 마사이어 (탄자니아) */
  mas_TZ = 'mas-TZ',
  /** 메루어 */
  mer = 'mer',
  /** 메루어 (케냐) */
  mer_KE = 'mer-KE',
  /** 모리셴어 */
  mfe = 'mfe',
  /** 모리셴어 (모리셔스) */
  mfe_MU = 'mfe-MU',
  /** 말라가시어 */
  mg = 'mg',
  /** 말라가시어 (마다가스카르) */
  mg_MG = 'mg-MG',
  /** 마크와메토어 */
  mgh = 'mgh',
  /** 마크와메토어 (모잠비크) */
  mgh_MZ = 'mgh-MZ',
  /** 마케도니아어 */
  mk = 'mk',
  /** 마케도니아어 (북마케도니아) */
  mk_MK = 'mk-MK',
  /** 말라얄람어 */
  ml = 'ml',
  /** 말라얄람어 (인도) */
  ml_IN = 'ml-IN',
  /** 마라티어 */
  mr = 'mr',
  /** 마라티어 (인도) */
  mr_IN = 'mr-IN',
  /** 말레이어 */
  ms = 'ms',
  /** 말레이어 (브루나이) */
  ms_BN = 'ms-BN',
  /** 말레이어 (말레이시아) */
  ms_MY = 'ms-MY',
  /** 몰타어 */
  mt = 'mt',
  /** 몰타어 (몰타) */
  mt_MT = 'mt-MT',
  /** 문당어 */
  mua = 'mua',
  /** 문당어 (카메룬) */
  mua_CM = 'mua-CM',
  /** 버마어 */
  my = 'my',
  /** 버마어 (미얀마) */
  my_MM = 'my-MM',
  /** 나마어 */
  naq = 'naq',
  /** 나마어 (나미비아) */
  naq_NA = 'naq-NA',
  /** 노르웨이어 (보크몰) */
  nb = 'nb',
  /** 노르웨이어 (보크몰, 노르웨이) */
  nb_NO = 'nb-NO',
  /** 북엔데벨레어 */
  nd = 'nd',
  /** 북엔데벨레어 (짐바브웨) */
  nd_ZW = 'nd-ZW',
  /** 네팔어 */
  ne = 'ne',
  /** 네팔어 (인도) */
  ne_IN = 'ne-IN',
  /** 네팔어 (네팔) */
  ne_NP = 'ne-NP',
  /** 네덜란드어 */
  nl = 'nl',
  /** 네덜란드어 (아루바) */
  nl_AW = 'nl-AW',
  /** 네덜란드어 (벨기에) */
  nl_BE = 'nl-BE',
  /** 네덜란드어 (쿠라사오) */
  nl_CW = 'nl-CW',
  /** 네덜란드어 (네덜란드) */
  nl_NL = 'nl-NL',
  /** 네덜란드어 (신트마르턴) */
  nl_SX = 'nl-SX',
  /** 크와시오어 */
  nmg = 'nmg',
  /** 크와시오어 (카메룬) */
  nmg_CM = 'nmg-CM',
  /** 노르웨이어 (니노르스크) */
  nn = 'nn',
  /** 노르웨이어 (니노르스크, 노르웨이) */
  nn_NO = 'nn-NO',
  /** 누에르어 */
  nus = 'nus',
  /** 누에르어 (남수단) */
  nus_SD = 'nus-SD',
  /** 냔콜어 */
  nyn = 'nyn',
  /** 냔콜어 (우간다) */
  nyn_UG = 'nyn-UG',
  /** 오로모어 */
  om = 'om',
  /** 오로모어 (에티오피아) */
  om_ET = 'om-ET',
  /** 오로모어 (케냐) */
  om_KE = 'om-KE',
  /** 오리야어 */
  or = 'or',
  /** 오리야어 (인도) */
  or_IN = 'or-IN',
  /** 펀자브어 */
  pa = 'pa',
  /** 펀자브어 (아랍 문자) */
  pa_Arab = 'pa-Arab',
  /** 펀자브어 (아랍 문자, 파키스탄) */
  pa_Arab_PK = 'pa-Arab-PK',
  /** 펀자브어 (구르무키 문자) */
  pa_Guru = 'pa-Guru',
  /** 펀자브어 (구르무키 문자, 인도) */
  pa_Guru_IN = 'pa-Guru-IN',
  /** 폴란드어 */
  pl = 'pl',
  /** 폴란드어 (폴란드) */
  pl_PL = 'pl-PL',
  /** 파슈토어 */
  ps = 'ps',
  /** 파슈토어 (아프가니스탄) */
  ps_AF = 'ps-AF',
  /** 포르투갈어 */
  pt = 'pt',
  /** 포르투갈어 (앙골라) */
  pt_AO = 'pt-AO',
  /** 포르투갈어 (브라질) */
  pt_BR = 'pt-BR',
  /** 포르투갈어 (기니비사우) */
  pt_GW = 'pt-GW',
  /** 포르투갈어 (모잠비크) */
  pt_MZ = 'pt-MZ',
  /** 포르투갈어 (포르투갈) */
  pt_PT = 'pt-PT',
  /** 포르투갈어 (상투메 프린시페) */
  pt_ST = 'pt-ST',
  /** 로만슈어 */
  rm = 'rm',
  /** 로만슈어 (스위스) */
  rm_CH = 'rm-CH',
  /** 키룬디어 */
  rn = 'rn',
  /** 키룬디어 (부룬디) */
  rn_BI = 'rn-BI',
  /** 루마니아어 */
  ro = 'ro',
  /** 루마니아어 (몰도바) */
  ro_MD = 'ro-MD',
  /** 루마니아어 (루마니아) */
  ro_RO = 'ro-RO',
  /** 롬보어 */
  rof = 'rof',
  /** 롬보어 (탄자니아) */
  rof_TZ = 'rof-TZ',
  /** 러시아어 */
  ru = 'ru',
  /** 러시아어 (몰도바) */
  ru_MD = 'ru-MD',
  /** 러시아어 (러시아) */
  ru_RU = 'ru-RU',
  /** 러시아어 (우크라이나) */
  ru_UA = 'ru-UA',
  /** 키냐르완다어 */
  rw = 'rw',
  /** 키냐르완다어 (르완다) */
  rw_RW = 'rw-RW',
  /** 루안조어 */
  rwk = 'rwk',
  /** 루안조어 (탄자니아) */
  rwk_TZ = 'rwk-TZ',
  /** 삼부루어 */
  saq = 'saq',
  /** 삼부루어 (케냐) */
  saq_KE = 'saq-KE',
  /** 상구어 */
  sbp = 'sbp',
  /** 상구어 (탄자니아) */
  sbp_TZ = 'sbp-TZ',
  /** 세나어 */
  seh = 'seh',
  /** 세나어 (모잠비크) */
  seh_MZ = 'seh-MZ',
  /** 코이러보로세니어 */
  ses = 'ses',
  /** 코이러보로세니어 (말리) */
  ses_ML = 'ses-ML',
  /** 산고어 */
  sg = 'sg',
  /** 산고어 (중앙 아프리카 공화국) */
  sg_CF = 'sg-CF',
  /** 타셸히트어 */
  shi = 'shi',
  /** 타셸히트어 (라틴) */
  shi_Latn = 'shi-Latn',
  /** 타셸히트어 (라틴, 모로코) */
  shi_Latn_MA = 'shi-Latn-MA',
  /** 타셸히트어 (타피나그) */
  shi_Tfng = 'shi-Tfng',
  /** 타셸히트어 (타피나그, 모로코) */
  shi_Tfng_MA = 'shi-Tfng-MA',
  /** 신할라어 */
  si = 'si',
  /** 신할라어 (스리랑카) */
  si_LK = 'si-LK',
  /** 슬로바키아어 */
  sk = 'sk',
  /** 슬로바키아어 (슬로바키아) */
  sk_SK = 'sk-SK',
  /** 슬로베니아어 */
  sl = 'sl',
  /** 슬로베니아어 (슬로베니아) */
  sl_SI = 'sl-SI',
  /** 쇼나어 */
  sn = 'sn',
  /** 쇼나어 (짐바브웨) */
  sn_ZW = 'sn-ZW',
  /** 소말리어 */
  so = 'so',
  /** 소말리어 (지부티) */
  so_DJ = 'so-DJ',
  /** 소말리어 (에티오피아) */
  so_ET = 'so-ET',
  /** 소말리어 (케냐) */
  so_KE = 'so-KE',
  /** 소말리어 (소말리아) */
  so_SO = 'so-SO',
  /** 알바니아어 */
  sq = 'sq',
  /** 알바니아어 (알바니아) */
  sq_AL = 'sq-AL',
  /** 세르비아어 */
  sr = 'sr',
  /** 세르비아어 (키릴) */
  sr_Cyrl = 'sr-Cyrl',
  /** 세르비아어 (키릴, 보스니아 헤르체고비나) */
  sr_Cyrl_BA = 'sr-Cyrl-BA',
  /** 세르비아어 (키릴, 몬테네그로) */
  sr_Cyrl_ME = 'sr-Cyrl-ME',
  /** 세르비아어 (키릴, 세르비아) */
  sr_Cyrl_RS = 'sr-Cyrl-RS',
  /** 세르비아어 (라틴) */
  sr_Latn = 'sr-Latn',
  /** 세르비아어 (라틴, 보스니아 헤르체고비나) */
  sr_Latn_BA = 'sr-Latn-BA',
  /** 세르비아어 (라틴, 몬테네그로) */
  sr_Latn_ME = 'sr-Latn-ME',
  /** 세르비아어 (라틴, 세르비아) */
  sr_Latn_RS = 'sr-Latn-RS',
  /** 스웨덴어 */
  sv = 'sv',
  /** 스웨덴어 (핀란드) */
  sv_FI = 'sv-FI',
  /** 스웨덴어 (스웨덴) */
  sv_SE = 'sv-SE',
  /** 스와힐리어 */
  sw = 'sw',
  /** 스와힐리어 (케냐) */
  sw_KE = 'sw-KE',
  /** 스와힐리어 (탄자니아) */
  sw_TZ = 'sw-TZ',
  /** 콩고 스와힐리어 */
  swc = 'swc',
  /** 콩고 스와힐리어 (콩고 민주 공화국) */
  swc_CD = 'swc-CD',
  /** 타밀어 */
  ta = 'ta',
  /** 타밀어 (인도) */
  ta_IN = 'ta-IN',
  /** 타밀어 (스리랑카) */
  ta_LK = 'ta-LK',
  /** 텔루구어 */
  te = 'te',
  /** 텔루구어 (인도) */
  te_IN = 'te-IN',
  /** 테소어 */
  teo = 'teo',
  /** 테소어 (케냐) */
  teo_KE = 'teo-KE',
  /** 테소어 (우간다) */
  teo_UG = 'teo-UG',
  /** 태국어 */
  th = 'th',
  /** 태국어 (태국) */
  th_TH = 'th-TH',
  /** 티그리냐어 */
  ti = 'ti',
  /** 티그리냐어 (에리트레아) */
  ti_ER = 'ti-ER',
  /** 티그리냐어 (에티오피아) */
  ti_ET = 'ti-ET',
  /** 통가어 */
  to = 'to',
  /** 통가어 (통가) */
  to_TO = 'to-TO',
  /** 터키어 */
  tr = 'tr',
  /** 터키어 (터키) */
  tr_TR = 'tr-TR',
  /** 타사와크어 */
  twq = 'twq',
  /** 타사와크어 (니제르) */
  twq_NE = 'twq-NE',
  /** 중앙 아틀라스 타마지트어 */
  tzm = 'tzm',
  /** 중앙 아틀라스 타마지트어 (라틴) */
  tzm_Latn = 'tzm-Latn',
  /** 중앙 아틀라스 타마지트어 (라틴, 모로코) */
  tzm_Latn_MA = 'tzm-Latn-MA',
  /** 우크라이나어 */
  uk = 'uk',
  /** 우크라이나어 (우크라이나) */
  uk_UA = 'uk-UA',
  /** 우르두어 */
  ur = 'ur',
  /** 우르두어 (인도) */
  ur_IN = 'ur-IN',
  /** 우르두어 (파키스탄) */
  ur_PK = 'ur-PK',
  /** 우즈베크어 */
  uz = 'uz',
  /** 우즈베크어 (아랍) */
  uz_Arab = 'uz-Arab',
  /** 우즈베크어 (아랍, 아프가니스탄) */
  uz_Arab_AF = 'uz-Arab-AF',
  /** 우즈베크어 (키릴) */
  uz_Cyrl = 'uz-Cyrl',
  /** 우즈베크어 (키릴, 우즈베키스탄) */
  uz_Cyrl_UZ = 'uz-Cyrl-UZ',
  /** 우즈베크어 (라틴) */
  uz_Latn = 'uz-Latn',
  /** 우즈베크어 (라틴, 우즈베키스탄) */
  uz_Latn_UZ = 'uz-Latn-UZ',
  /** 바이어 */
  vai = 'vai',
  /** 바이어 (라틴) */
  vai_Latn = 'vai-Latn',
  /** 바이어 (라틴, 라이베리아) */
  vai_Latn_LR = 'vai-Latn-LR',
  /** 바이어 (바이 문자) */
  vai_Vaii = 'vai-Vaii',
  /** 바이어 (바이 문자, 라이베리아) */
  vai_Vaii_LR = 'vai-Vaii-LR',
  /** 베트남어 */
  vi = 'vi',
  /** 베트남어 (베트남) */
  vi_VN = 'vi-VN',
  /** 분조어 */
  vun = 'vun',
  /** 분조어 (탄자니아) */
  vun_TZ = 'vun-TZ',
  /** 소가어 */
  xog = 'xog',
  /** 소가어 (우간다) */
  xog_UG = 'xog-UG',
  /** 양벤어 */
  yav = 'yav',
  /** 양벤어 (카메룬) */
  yav_CM = 'yav-CM',
  /** 요루바어 */
  yo = 'yo',
  /** 요루바어 (나이지리아) */
  yo_NG = 'yo-NG',
  /** 중국어 */
  zh = 'zh',
  /** 중국어 (간체) */
  zh_Hans = 'zh-Hans',
  /** 중국어 (간체, 대만) */
  zh_Hans_TW = 'zh-Hans-TW',
}
